# Author = Khalkechev Dmitry Arturovich
# Group = P3109
# Date = 18.10.2025

print(f"Вариант: {502026%7}")
import re; text = input().split('/'); print("Хайку!" if len(text) == 3 and [len(re.findall(r'[аеёиоуюяАЕЁИОУЮЯ]', text[i])) for i in range(3)] == [5,7,5] else "Не хайку." if len(text) == 3 else "Не хайку. Должно быть 3 строки.")

# Тихий вечер плывёт / Птицы на юг улетают / Осень наступил
# Просто две строки / Без третьей строки тут
# Солнце светит ярко / День прекрасный на дворе / Радость
# Дождь стучит в окно... / Забытые пИисьма ждуут / Осень в старом дом.
# Только первая строка /  /