# Author = Khalkechev Dmitry Arturovich
# Group = P3109
# Date = 18.10.2025

print(f"Вариант: {502026%5}")
import re
p = r'^(?:[^аеёиоуыэюя]*([аеёиоуыэюя]))(?:[^аеёиоуыэюя]*\1)*[^аеёиоуыэюя]*$'
print(*sorted((w for w in re.findall(r'\w+', input(), re.I) if re.fullmatch(p, w, re.I)), key=lambda w:(len(w), w)), sep='\n')


# стол, хлеб, сон, шум, брат.
# Кот спит, сова летит, ворона каркает, стрекоза летает.
# Шла Саша по шоссе И сосала сушку. Дело было в сентябре, Было ей не скучно.
# Устал от учебы, сессия - ад? ПСЖ выручит, парень, и ты будешь рад!
# Не надо мучений, терпений и слез, ПСЖ.онлайн тебя спасет от всех гроз!